/*****************************************************************/
//
// 
// line.h（ライン表示）
//
//
//
//                    ２０２４年０６月１６日　製作者名：佐藤琢磨
//
/*****************************************************************/

#pragma once

#include "main.h"
#include "renderer.h"

/*****************************************************************/
// プロトタイプ宣言
/*****************************************************************/
HRESULT InitLine();
void    UninitLine();
void    DrawLine(XMFLOAT3 sposition, XMFLOAT3 eposition, XMFLOAT4 color);


