#pragma once
/*****************************************************************/
//
// 
// Manager.h（マネージャーヘッダー）
//
//
//
//                    ２０２４年０６月１６日　製作者名：佐藤琢磨
//
/*****************************************************************/

//シーン番号
enum SCENE
{
	SCENE_NONE = 0, //何も実行しない
	SCENE_TITLE,
	SCENE_GAME,
	SCENE_RESULT,
};

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
void InitManager();
void UninitManager();
void UpdateManager();
void DrawManager();

void SetScene(SCENE Scene); //シーン切り替え




